mervinnguyen/m_core_rtos/GCC_STM32CubeIDE/6_CooperativeScheduler/Src/timebase.c
#include "timebase.h"
#include "stm32f4xx.h"

#define ONE_SEC_LOAD 	16000000

#define CTRL_ENABLE		(1u << 0)
#define CTRL_TICKINT	(1u << 1)
#define CTRL_CLCKSRC	(1u << 2)
#define CTRL_COUNTFLAG	(1u << 16)

#define MAX_DELAY		0xFFFFFFFFU

volatile uint32_t g_curr_tick;
volatile uint32_t g_curr_tick_p;
volatile uint32_t tick_freq = 1;

/* Delay in seconds */
void delay(uint32_t delay){
	uint32_t tickstart = get_tick();
	uint32_t wait = delay;

	if(wait < MAX_DELAY){
		wait += (uint32_t)(tick_freq);
	}

	while((get_tick() - tickstart < wait)){

	}
}

void tick_increment(void){
	g_curr_tick += tick_freq;
}

uint32_t get_tick(void){
	__disable_irq();
	g_curr_tick_p = g_curr_tick;
	__enable_irq();

	return g_curr_tick_p;
}

void timebase_init(void){
	/*Reload the timer with # of cycles per second*/
	SysTick -> LOAD = ONE_SEC_LOAD - 1;		//set LOAD to 16 Mhz

	/*Clear Systick current value register*/
	SysTick -> VAL = 0;

	/*Select internal clock source*/
	SysTick -> CTRL = CTRL_CLCKSRC;		//set clock control register (bit 2) to 1

	/*Enable interrupt */
	SysTick -> CTRL |= CTRL_TICKINT;

	/*Enable systick */
	SysTick -> CTRL |= CTRL_ENABLE;

	/*Enable global interrupts*/
	__enable_irq();
}

//void SysTick_Handler(void){
//	tick_increment();
//}
